CREATE DATABASE company;

USE company;


-- У даній базі даних створіть 3 таблиці,

-- У 1-й таблиці містяться імена та номери телефонів співробітників компанії.
CREATE TABLE телефони
(
id int auto_increment not null,
імя varchar(50) not null,
телефон varchar(50) null,
primary key (id)
);

INSERT INTO телефони (імя, телефон)
VALUES
('Ольга К.', "+3848494944"),
('Дмитро Т.', "+38748393030"),
('Іван П.', "+3493030202");

INSERT INTO телефони (імя, телефон)
VALUES
('Олена П.', "+345983953");



-- У 2-й таблиці містяться відомості про зарплату та посади співробітників: головний директор, менеджер, робітник.
CREATE TABLE зарплати
(
id int auto_increment not null,
посада varchar(50) not null,
зарплата int not null,
primary key (id)
);

INSERT INTO зарплати (посада, зарплата)
VALUES
('головний директор', 20000),
('менеджер', 15000),
('робітник', 10000);

INSERT INTO зарплати (посада, зарплата)
VALUES
('менеджер', 15000);



-- У 3-й таблиці міститься інформація про сімейний стан, дату народження та місце проживання.
CREATE TABLE особиста_інформація
(
id int auto_increment not null,
сімейний_стан varchar(50) not null,
дата_народження date not null,
місце_проживання varchar(50) not null,
primary key (id)
);

INSERT INTO особиста_інформація (сімейний_стан, дата_народження, місце_проживання)
VALUES
('незаміжня', '1997-09-22', 'м. Київ'),
('розлучений', '1992-06-16', 'м. Черкаси'),
('одружений', '1995-07-19', 'м. Київ');

INSERT INTO особиста_інформація (сімейний_стан, дата_народження, місце_проживання)
VALUES
('незаміжня', '1995-05-16', 'м. Черкаси');



-- Зробіть вибірку за допомогою JOIN's для таких завдань:

-- 1) Отримайте контактні дані співробітників (номери телефонів, місце проживання).
SELECT телефони.імя, телефони.телефон, особиста_інформація.місце_проживання FROM телефони
LEFT JOIN особиста_інформація
ON телефони.id = особиста_інформація.id;

-- 2) Отримайте інформацію про дату народження всіх неодружених співробітників та їх номери.
SELECT телефони.імя, телефони.телефон, особиста_інформація.дата_народження, особиста_інформація.сімейний_стан FROM телефони
JOIN особиста_інформація
ON телефони.id = особиста_інформація.id
WHERE сімейний_стан = 'незаміжня';

-- 3) Отримайте інформацію про всіх менеджерів компанії: дату народження та номер телефону.
SELECT т.імя, т.телефон, о.дата_народження, з.посада FROM телефони AS т
JOIN особиста_інформація AS о
ON т.id = о.id
JOIN зарплати AS з
ON т.id = з.id
WHERE посада = 'менеджер';



