USE company;

-- 1. Необхідно дізнатися контактні дані працівників (номери телефонів, місце проживання).
SELECT імя, телефон, місце_проживання FROM телефони AS т
JOIN особиста_інформація AS о
ON о.id = т.id;

-- 2. Необхідно дізнатися інформацію про дату народження всіх неодружених співробітників та номери телефонів цих працівників.
SELECT імя, телефон, сімейний_стан, дата_народження FROM телефони AS т
JOIN особиста_інформація AS о
ON о.id = т.id
WHERE сімейний_стан = 'незаміжня';

-- 3. Необхідно дізнатися інформацію про дату народження всіх співробітників з посадою менеджера та номери телефонів цих співробітників.
SELECT імя, телефон, посада, дата_народження FROM телефони AS т
	JOIN особиста_інформація AS о
		ON о.id = т.id
	JOIN зарплати AS з
		ON з.id = т.id
WHERE посада = 'менеджер';