USE company;

-- Завдання 4
-- Зробіть вибірку за допомогою вкладених запитів для таких завдань:
-- 1) Отримайте контактні дані співробітників (номери телефонів, місце проживання).

SELECT імя,
	   (SELECT місце_проживання FROM особиста_інформація AS о WHERE о.ID = т.ID) AS місце_проживання,
       телефон 
FROM телефони AS т;


-- 2) Отримайте інформацію про дату народження всіх неодружених співробітників та їх номери.

SELECT імя, 
       (SELECT дата_народження FROM особиста_інформація AS о WHERE о.ID = т.ID) AS дата_народження,
       (SELECT сімейний_стан FROM особиста_інформація AS о WHERE о.ID = т.ID) AS сімейний_стан,
       телефон
FROM телефони AS т
WHERE т.ID IN (SELECT ID FROM особиста_інформація WHERE сімейний_стан = 'незаміжня');


-- 3) Отримайте інформацію про всіх менеджерів компанії: дату народження та номер телефону.

SELECT імя, 
       (SELECT дата_народження FROM особиста_інформація AS о WHERE о.ID = т.ID) AS дата_народження,
       (SELECT посада FROM зарплати AS з WHERE з.ID = т.ID) AS посада,
       телефон
FROM телефони AS т
WHERE т.ID IN (SELECT ID FROM зарплати WHERE посада = 'менеджер');

